Workshop4/jmeter/results/html-report-all/statistics.json
{
  "POST /categories" : {
    "transaction" : "POST /categories",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.2939958592132506,
    "receivedKBytesPerSec" : 0.20724152432712217,
    "sentKBytesPerSec" : 0.24262422360248448
  },
  "GET /books" : {
    "transaction" : "GET /books",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.4,
    "medianResTime" : 7.0,
    "minResTime" : 6.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 10.0,
    "throughput" : 1.2909888974954815,
    "receivedKBytesPerSec" : 0.6013688516653757,
    "sentKBytesPerSec" : 0.4223450006454944
  },
  "GET /categories-1" : {
    "transaction" : "GET /categories-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.4,
    "medianResTime" : 4.0,
    "minResTime" : 4.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.2929919834497026,
    "receivedKBytesPerSec" : 1.2374337341608481,
    "sentKBytesPerSec" : 0.21844493470390483
  },
  "GET /users-0" : {
    "transaction" : "GET /users-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.2939958592132506,
    "receivedKBytesPerSec" : 0.20092318517080746,
    "sentKBytesPerSec" : 0.21103252782091098
  },
  "GET /categories-0" : {
    "transaction" : "GET /categories-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.2939958592132506,
    "receivedKBytesPerSec" : 0.20724152432712217,
    "sentKBytesPerSec" : 0.2173508669772257
  },
  "GET /users-1" : {
    "transaction" : "GET /users-1",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 3.4,
    "medianResTime" : 3.0,
    "minResTime" : 3.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.2933264355923435,
    "receivedKBytesPerSec" : 0.20460828375581996,
    "sentKBytesPerSec" : 0.21218636833936885
  },
  "POST Java /auth/login" : {
    "transaction" : "POST Java /auth/login",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 5.8,
    "medianResTime" : 5.0,
    "minResTime" : 5.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 1.2906556530717603,
    "receivedKBytesPerSec" : 0.4789542462570986,
    "sentKBytesPerSec" : 0.2419979349509551
  },
  "GET /books-0" : {
    "transaction" : "GET /books-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.2926577042399172,
    "receivedKBytesPerSec" : 0.2007154052481903,
    "sentKBytesPerSec" : 0.21081429356256465
  },
  "GET /loans" : {
    "transaction" : "GET /loans",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 1.2923235978288963,
    "receivedKBytesPerSec" : 0.40511315908503487,
    "sentKBytesPerSec" : 0.4227816457741018
  },
  "GET /books-1" : {
    "transaction" : "GET /books-1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.4,
    "medianResTime" : 4.0,
    "minResTime" : 4.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.2926577042399172,
    "receivedKBytesPerSec" : 0.4014308104963806,
    "sentKBytesPerSec" : 0.21207665460186143
  },
  "POST Java /auth/register" : {
    "transaction" : "POST Java /auth/register",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 16.2,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 52.0,
    "pct1ResTime" : 52.0,
    "pct2ResTime" : 52.0,
    "pct3ResTime" : 52.0,
    "throughput" : 1.2748597654258031,
    "receivedKBytesPerSec" : 0.4730924910759816,
    "sentKBytesPerSec" : 0.242771146736359
  },
  "POST /books" : {
    "transaction" : "POST /books",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.2939958592132506,
    "receivedKBytesPerSec" : 0.20092318517080746,
    "sentKBytesPerSec" : 0.2363058844461698
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 90,
    "errorCount" : 30,
    "errorPct" : 33.333332,
    "meanResTime" : 4.844444444444444,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 52.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 52.0,
    "throughput" : 22.65861027190332,
    "receivedKBytesPerSec" : 7.464359894259819,
    "sentKBytesPerSec" : 4.68489386644008
  },
  "GET /users" : {
    "transaction" : "GET /users",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 5.6,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 1.2926577042399172,
    "receivedKBytesPerSec" : 0.40521789361427096,
    "sentKBytesPerSec" : 0.4228909481644261
  },
  "GET /categories" : {
    "transaction" : "GET /categories",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 6.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 1.2919896640826873,
    "receivedKBytesPerSec" : 1.4433947028423773,
    "sentKBytesPerSec" : 0.43528948643410853
  },
  "GET /books/available" : {
    "transaction" : "GET /books/available",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.6,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.2926577042399172,
    "receivedKBytesPerSec" : 0.4014308104963806,
    "sentKBytesPerSec" : 0.2234379039555326
  },
  "GET Python /health" : {
    "transaction" : "GET Python /health",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.8,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.2916559028674761,
    "receivedKBytesPerSec" : 0.18290049405838285,
    "sentKBytesPerSec" : 0.2119122965641953
  },
  "GET /loans-0" : {
    "transaction" : "GET /loans-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.29366106080207,
    "receivedKBytesPerSec" : 0.20087119987063387,
    "sentKBytesPerSec" : 0.21097792690815007
  },
  "GET /loans-1" : {
    "transaction" : "GET /loans-1",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 3.4,
    "medianResTime" : 3.0,
    "minResTime" : 3.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.2933264355923435,
    "receivedKBytesPerSec" : 0.20460828375581996,
    "sentKBytesPerSec" : 0.21218636833936885
  }
}